{"intents":  [
  {"tag" : "greetings",
   "patterns": ["hello","hey","good day","Greetings"],
    "responses" : ["Hello!","Hey!","What can i do for you?","How can i help you?", "Hi there!", "Hi!"]
  },
  {"tag" : "goodbye",
    "patterns" : ["See you later", "Goodbye","Have a good day", "bye","cya","see you soon"],
    "responses": ["Goodbye!", "Talk to you later"]
  },
  {"tag": "teachers",
    "patterns" : ["how many teachers are there", "how many teaching staff is there "],
    "responses" : ["There are x number of teachers"]
  },
  {"tag": "labs",
    "patterns" : ["how many labs are there", "numbers of lab in departments"],
    "responses" : ["There are x number of working labs present"]
  },
  {"tag": "vision",
  "patterns" : ["What is the vision of the department", "what is the objective of the computer department"],
  "responses" : ["To become nationally reputed department producing universally competent engineers, to benefit sustained growth of an individual and the society at large."]
  },
  {"tag": "mission",
  "patterns" : ["What is the mission of the department", "what is the goal of the computer department"],
  "responses" : ["1) To provide learning ambience for students and faculties through infrastructure, expertise and training.\n 2) To develop technically competent professionals with strong foundations, capable of adapting with the changing technologies for developing world class software.\n 3) To inculcate professional, social and ethical values in students by providing opportunities to solve environmental and social problems.."]
  },
  {"tag": "location",
  "patterns" : ["Where is the college located?", "what is the address of the college?", "what is the location of the college?", "where is the college?","Address of the college?"],
  "responses" : ["Survey No. 12, 13, Opp. Hypercity Mall, Kasarvadavali, Ghodbunder Road, Thane West, Thane, Maharashtra 400615"]
  },
  {"tag": "contact",
  "patterns" : ["What is the contact number of the college?", "what is the phone number of the college?", "what is the contact number of the college?", "what is the phone number of the college?"],
  "responses" : ["Phone 022-25973737 and Mobile 7738305400 or 7738940600"]
  },
  {"tag": "intake",
  "patterns" : ["What is the intake in the computer engineering department?", "How many students are taken in per year?", "what is the maximum amount of students in this department?"],
  "responses" : ["The maximum intake of students in the department is 180"]
  },
  {"tag": "HOD",
  "patterns" : ["Who is the head of department of computer engineering?", "What is the name of the head of the department?","what is the name of the hod of the department?"],
  "responses" : ["Prof. Sachin H. Malave is the head of department of computer engineering"]
  },
  {"tag": "no_faculty",
  "patterns" : ["How many faculty are there in this department?", "what is the total amount of faculty in computer department?", "Who are the teachers of the department?"],
  "responses" : ["There are currently 29 faculty in the computer engineering department.", "There are 29 faculty  where there are 1 head of department\n 2 associate professors\n 24 assistant professors\n 2 teaching assistant."]
  },
  {"tag" : "Qualifications",
   "patterns": ["What are the qualifications of the faculty?", "What are the qualifications of the teachers?","Qualifications of the faculty"],
    "responses" : ["There are 3 professors with PhD degree, 9 professors who are purusing PhD, 12 professors with M.E degree , 3 with M.Tech degree and 2 with B.E degree"]
  },
  {"tag" : "PhD",
   "patterns": ["What are the name of the professors with PhD degree?","Name all the professor with PhD degree"],
    "responses" : ["There are currently 3 professors with PhD degree which are Dr. Pravin Adivarekar, Dr. Rahul Ambekar and Dr. Mamta Kurvey"]
  }

]}
